"""
Создайте несколько переменных разных типов. 
Проверьте к какому типу относятся созданные переменные.
"""
a = 5
b = 5.1
c = "Hello"
d = {a,b,c}
e = [1,2,3]
f = {a:1, b:2}

print(type(a),type(b), type(c))
print(type(d),type(e),type(f))
